STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_lptim.c
/**
  **********************************************************************************************************************
  * @file    stm32_adv_lpbam_lptim.c
  * @author  MCD Application Team
  * @brief   This file provides the advanced LPBAM layer for LPTIM peripheral.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  @verbatim
  ======================================================================================================================
                                 ############### How to use this driver ###############
  ======================================================================================================================
    [..]
      It is recommended to read carefully the GettingStarted.html document before starting developing an LPBAM
      application.

    *** Driver description ***
    ==========================
    [..]
      This driver is dedicated for LPTIM that supports linked-list feature.
      This advanced LPBAM module counts 3 files :
          (+) stm32_adv_lpbam_lptim.c
              (++) This file provides the LPTIM advanced files body.
          (+) stm32_adv_lpbam_lptim.h
              (++) This file is the header file of stm32_adv_lpbam_lptim.c. It provides used types
          (+) stm32_platform_lpbam_lptim.h
              (++) This header file contains all defines to be used in applicative side.

    *** Driver features ***
    =======================
    [..]
      This driver provides the following list of features :
          (+) Starts the LPTIM channel for PWM, input capture and compare match modes.
          (+) Stops the LPTIM peripheral for PWM, input capture and compare match modes.
          (+) Update the pulse, the period and the repetition values for PWM waveform.
          (+) Get capture values for LPTIM input signal.
          (+) Update the period and the repetition values and starts the LPTIM counter to generate an update event.

    *** Functional description ***
    ==============================
    [..]
      The LPTIM peripheral can be started and stopped through a DMA channel thanks to a build DMA linked-list queue in
      three different mode :
          (+) PWM mode where the LPTIM channel is configured as output.
          (+) Input capture mode where the LPTIM channel is configured as input.
          (+) Compare match mode where the LPTIM channel is configured as output.
      The PWM Waveform can be changed by updating the period, pulse and the repetition thanks to a build DMA linked-list
      queue.
      A input capture of external signal can be read and stored in a buffer thanks to a build DMA linked-list queue.
      A compare match can be configured and started thanks to a build DMA linked-list queue.

      The output of this driver is a queue to be executed by the DMA channel.

    *** Driver APIs description ***
    ===============================
    [..]
      Use ADV_LPBAM_LPTIM_Start_SetFullQ() API to build a linked-list queue that starts the LPTIM channel in single or
      in continuous mode according to parameters in the LPBAM_LPTIM_StartFullAdvConf_t structure.
      Configured parameters are :
          (+) StartMode  : Specifies the LPTIM Start Mode.
                           This parameter can be a value of @ref LPBAM_LPTIM_ContinuousMode.
          (+) WakeupIT   : Specifies the wake up source interrupt.
                           This parameter can be one or a combination of @ref LPBAM_LPTIM_Wakeup_Interrupt.
      This API must be called when the LPTIM is disabled for each mode.

    [..]
      Use ADV_LPBAM_LPTIM_Stop_SetFullQ() API to build a linked-list queue that stops the LPTIM peripheral in single or
      in continuous mode according to parameters in the LPBAM_LPTIM_StopFullAdvConf_t structure.
      Configured parameters are :
          (+) Mode  : Specifies the LPTIM Mode.
                      This parameter can be a value of @ref LPBAM_LPTIM_Mode.
      This API must be called when the LPTIM is enabled for each mode in start a new operation.

    [..]
      Use ADV_LPBAM_LPTIM_PWM_SetFullQ() API to build a linked-list queue that updates at each update event request
      generated the the period or/and the pulse or/and the repetition values according to parameters in the
      LPBAM_LPTIM_StartFullAdvConf_t structure.
      Configured parameters are :
          (+) UpdatePeriod     : Specifies the period update state
                                 This parameter can be ENABLE or DISABLE.
          (+) PeriodValue      : Specifies the period values.
          (+) UpdatePulse      : Specifies the pulse update state.
                                 This parameter can be ENABLE or DISABLE.
          (+) PulseValue       : Specifies the pulse values.
          (+) UpdateRepetition : Specifies the repetition update state.
                                 This parameter can be ENABLE or DISABLE.
          (+) RepetitionValue  : Specifies the repetition values.

      This API must be called when the LPTIM channel is well initialized PWM mode.
          (+) Recommended LPTIM initialization sequence
              (++) Call HAL_LPTIM_Init() to initialize LPTIM Instance. (Mandatory)
                   Initialization parameters can be :
                   (+++) CounterSource                 : LPTIM_COUNTERSOURCE_INTERNAL.
                   (+++) UpdateMode                    : LPTIM_UPDATE_IMMEDIATE.
                   (+++) Clock Source                  : LPTIM_CLOCKSOURCE_APBCLOCK_LPOSC.
                   (+++) Clock Prescaler               : LPTIM_PRESCALER_DIV1.
                   (+++) UltraLowPowerClock Polarity   : LPTIM_CLOCKPOLARITY_RISING.
                   (+++) UltraLowPowerClock SampleTime : LPTIM_CLOCKSAMPLETIME_DIRECTTRANSITION.
                   (+++) Trigger Source                : LPTIM_TRIGSOURCE_SOFTWARE.
                   (+++) Trigger ActiveEdge            : LPTIM_ACTIVEEDGE_RISING.
                   (+++) Trigger SampleTime            : LPTIM_TRIGSAMPLETIME_DIRECTTRANSITION.
                   (+++) Period                        : Initial period value.
                   (+++) RepetitionCounter             : Initial period repetition value.
              (++) Call HAL_LPTIM_OC_ConfigChannel() to configure the LPTIM channel as Output. (Mandatory)
                   Initialization parameters can be :
                   (+++) Pulse      : Initial pulse value.
                   (+++) OCPolarity : LPTIM_OCPOLARITY_HIGH.

