STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_lptim.c
    [..]
      Use ADV_LPBAM_LPTIM_IC_SetFullQ() API to build a linked-list queue that starts the input capture mode of an LPTIM
      input signal according to parameters in the LPBAM_LPTIM_ICFullAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_FIXED. (Mandatory)
          (+) DestInc           : DMA_DINC_INCREMENTED.
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_HALFWORD. (Mandatory)
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_HALFWORD.
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

      Configured parameters are :
          (+) pData  : Specifies the address of data buffer.
          (+) Size   : Specifies the size of data to be read.
      This API must be called when the LPTIM Instance is initialized in input mode.
          (+) Recommended LPTIM initialization sequence
              Initialization parameters can be :
              (++) Call HAL_LPTIM_Init() to initialize LPTIM Instance. (Mandatory)
                   (+++) CounterSource                 : LPTIM_COUNTERSOURCE_INTERNAL.
                   (+++) UpdateMode                    : LPTIM_UPDATE_IMMEDIATE.
                   (+++) Clock Source                  : LPTIM_CLOCKSOURCE_APBCLOCK_LPOSC.
                   (+++) Clock.Prescaler               : LPTIM_PRESCALER_DIV1 .
                   (+++) UltraLowPowerClock Polarity   : LPTIM_CLOCKPOLARITY_RISING.
                   (+++) UltraLowPowerClock SampleTime : LPTIM_CLOCKSAMPLETIME_DIRECTTRANSITION.
                   (+++) Trigger Source                : LPTIM_TRIGSOURCE_SOFTWARE.
                   (+++) Trigger ActiveEdge            : LPTIM_ACTIVEEDGE_RISING.
                   (+++) Trigger SampleTime            : LPTIM_TRIGSAMPLETIME_DIRECTTRANSITION.
                   (+++) TInput1Source                 : LPTIM_INPUT1SOURCE_GPIO.
                   (+++) TInput2Source                 : LPTIM_INPUT2SOURCE_GPIO.
                   (+++) Period                        : Initial period value.
                   (+++) RepetitionCounter             : Initial period repetition value.
              (++) Call HAL_LPTIM_IC_ConfigChannel() to configure the LPTIM channel as input. (Mandatory)
                   Initialization parameters can be :
                   (+++) ICFilter      : LPTIM_ICFLT_CLOCK_DIV1.
                   (+++) ICPolarity    : LPTIM_ICPOLARITY_RISING.
                   (+++) ICPrescaler   : LPTIM_ICPSC_DIV1.
                   (+++) ICInputSource : LPTIM_IC2SOURCE_GPIO.
              (++) Call __HAL_LPTIM_ENABLE_IT() to enable LPTIM Over Capture interrupt.
                   Any LPTIM error occurred in low power block the LPBAM sub-system mechanisms.
                   LPTIM  interrupts can be :
                   (+++) LPTIM_IT_CC1O : Capture/compare 1 over-capture interrupt enable.
                   (+++) LPTIM_IT_CC2O : Capture/compare 2 over-capture interrupt enable.

    [..]
      Use ADV_LPBAM_LPTIM_CM_SetFullQ() API to build a linked-list queue that starts the LPTIM compare match according
      to parameters in the LPBAM_LPTIM_CMFullAdvConf_t structure.
      Configured parameters are :
          (+) Period     : Specifies the capture compare period.
          (+) Repetition : Specifies the capture compare period repetition number.
      This API must be called when the LPTIM Instance is well initialized Capture compare mode.
          (+) Recommended LPTIM initialization sequence
              (++) Call HAL_LPTIM_Init() to initialize LPTIM Instance. (Mandatory)
                   Initialization parameters can be :
                   (+++) CounterSource                 : LPTIM_COUNTERSOURCE_INTERNAL.
                   (+++) UpdateMode                    : LPTIM_UPDATE_IMMEDIATE.
                   (+++) Clock Source                  : LPTIM_CLOCKSOURCE_APBCLOCK_LPOSC.
                   (+++) Clock Prescaler               : LPTIM_PRESCALER_DIV1.
                   (+++) UltraLowPowerClock Polarity   : LPTIM_CLOCKPOLARITY_RISING.
                   (+++) UltraLowPowerClock SampleTime : LPTIM_CLOCKSAMPLETIME_DIRECTTRANSITION.
                   (+++) Trigger Source                : LPTIM_TRIGSOURCE_SOFTWARE.
                   (+++) Trigger ActiveEdge            : LPTIM_ACTIVEEDGE_RISING.
                   (+++) Trigger SampleTime            : LPTIM_TRIGSAMPLETIME_DIRECTTRANSITION.
                   (+++) Period                        : Initial period value.
                   (+++) RepetitionCounter             : Initial period repetition value.

      The purpose of this API is generating events that can be used for trigger and system wake up purpose. So, the
      channels output is not enabled and no LPTIM channel signal is propagated.

    *** Driver user sequence ***
    ============================
    [..]
      PWM generation user sequence is :
          (+) Initialize LPTIM channel in output mode (Using HAL/LL). (Mandatory)
          (+) Call ADV_LPBAM_LPTIM_EnableDMARequests() to enable DMA requests and enable channel. (Mandatory)
          (+) Call ADV_LPBAM_LPTIM_Start_SetFullQ() to start the LPTIM channel. (Mandatory)
          (+) Repeat calling of ADV_LPBAM_LPTIM_PWM_SetFullQ() API to customize PWM signal for your application.
          (+) Call ADV_LPBAM_LPTIM_Stop_SetFullQ(). (When your scenario is not circular/Mandatory to restart another
              LPTIM mode)
          (+) Call ADV_LPBAM_Q_SetCircularMode() to circularize your linked-list queue for infinite scenarios cases.
              (++) Please check stm32_adv_lpbam_common.c (how to use section) for more information.
          (+) Call HAL_DMAEx_List_Link() to link the output queue to a master DMA channel. (Mandatory)
          (+) Call HAL_DMAEx_List_Start() to start the DMA channel linked-list execution. (Mandatory)
          (+) Call __HAL_DMA_ENABLE_IT() to enable error interrupts.
              Any DMA error occurred in low power block the LPBAM sub-system mechanisms.
              DMA error interrupts can be :
              (++) DMA_IT_DTE : data transfer error.
              (++) DMA_IT_ULE : update link error.
              (++) DMA_IT_USE : user setting error.
          (+) Call HAL_DMAEx_List_Start() to start the DMA channel linked-list execution. (Mandatory)

