STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_lptim.c
    [..]
      Input capture user sequence is :
          (+) Initialize LPTIM channel in input mode (Using HAL/LL). (Mandatory)
          (+) Call ADV_LPBAM_LPTIM_EnableDMARequests() to enable DMA requests and enable channel. (Mandatory)
          (+) Call ADV_LPBAM_LPTIM_Start_SetFullQ() to start the LPTIM channel. (Mandatory)
          (+) Repeat calling of ADV_LPBAM_LPTIM_IC_SetFullQ() API according to application.
          (+) Call ADV_LPBAM_LPTIM_Stop_SetFullQ(). (When your scenario is not circular/Mandatory to restart another
              LPTIM mode)
          (+) Call ADV_LPBAM_Q_SetCircularMode() to circularize your linked-list queue for infinite scenarios cases.
              (++) Please check stm32_adv_lpbam_common.c (how to use section) for more information.
          (+) Call HAL_DMAEx_List_Link() to link the output queue to a master DMA channel. (Mandatory)
          (+) Call HAL_DMAEx_List_Start() to start the DMA channel linked-list execution. (Mandatory)
          (+) Call __HAL_DMA_ENABLE_IT() to enable error interrupts.
              Any DMA error occurred in low power block the LPBAM sub-system mechanisms.
              DMA error interrupts can be :
              (++) DMA_IT_DTE : data transfer error.
              (++) DMA_IT_ULE : update link error.
              (++) DMA_IT_USE : user setting error.
          (+) Call HAL_DMAEx_List_Start() to start the DMA channel linked-list execution. (Mandatory)

    [..]
      Compare match user sequence is :
          (+) Initialize LPTIM channel in output mode (Using HAL/LL). (Mandatory)
          (+) Call ADV_LPBAM_LPTIM_EnableDMARequests() to enable DMA requests and enable channel. (Mandatory)
          (+) Call ADV_LPBAM_LPTIM_Start_SetFullQ() to start the LPTIM channel. (Mandatory)
          (+) Call ADV_LPBAM_LPTIM_CM_SetFullQ() API according to application.
          (+) Call ADV_LPBAM_LPTIM_Stop_SetFullQ(). (Mandatory)
          (+) Call ADV_LPBAM_Q_SetCircularMode() to circularize your linked-list queue for infinite scenarios cases.
              (++) Please check stm32_adv_lpbam_common.c (how to use section) for more information.
          (+) Call HAL_DMAEx_List_Link() to link the output queue to a master DMA channel. (Mandatory)
          (+) Call HAL_DMAEx_List_Start() to start the DMA channel linked-list execution. (Mandatory)
          (+) Call __HAL_DMA_ENABLE_IT() to enable error interrupts.
              Any DMA error occurred in low power block the LPBAM sub-system mechanisms.
              DMA error interrupts can be :
              (++) DMA_IT_DTE : data transfer error.
              (++) DMA_IT_ULE : update link error.
              (++) DMA_IT_USE : user setting error.
          (+) Call HAL_DMAEx_List_Start() to start the DMA channel linked-list execution. (Mandatory)

    *** Constraints ***
    ===================
    [..]
      After LPTIM initialization, only one mode is supported.
          (+) PWM mode.
          (+) Input capture mode.
          (+) Compare match mode.

    [..]
      When calling ADV_LPBAM_DMA_Stop_SetFullQ(), all LPTIM channels are disabled. So, disabling one LPTIM channel is
      not possible.

    [..]
      When configuring more then one LPTIM channel in PWM mode, take into consideration that the LPTIM period and
      repetition values are shared  between all channels.

    [..]
      When configuring the LPTIM in compare match mode, it's strongly not recommended to configure another functionality
      as the period and the repetition valuers are shared between all channels.

    [..]
      It's strongly not recommended to call any LPTIM API with the same channel by more than one linked-list queue. When
      the LPTIM nodes will be executed simultaneously unexpected behavior will appear.

    [..]
      It's strongly not recommended to execute the same linked-list queue that contains LPTIM configuration by two
      different DMA channels simultaneously as unexpected behavior can appear.

    *** Driver status description ***
    =================================
    [..]
      This driver detects and reports any detected issue.
          (+) returned values are :
              (++) LPBAM_OK when no error is detected.
              (++) LPBAM_ERROR when error is detected.
              (++) LPBAM_INVALID_ID when an invalid node ID is detected. This error value is specific for LPBAM basic
                   layer.

    @endverbatim
  **********************************************************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_lpbam.h"

#ifdef LPBAM_LPTIM_MODULE_ENABLED

/* Private typedef ---------------------------------------------------------------------------------------------------*/
/* Private define ----------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private macro -----------------------------------------------------------------------------------------------------*/
/* Private function prototypes ---------------------------------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup LPBAM_Utilities_Driver
  * @{
  */

/** @defgroup LPTIM_Advanced LPTIM_Advanced
  * @brief    LPTIM Advanced LPBAM module driver
  * @{
  */

/** @defgroup LPBAM_LPTIM_Advanced_Exported_Functions LPBAM LPTIM Advanced Exported Functions
  * @{
  */

/**
  * @brief  Build the LPTIM PWM full DMA linked-list queue according to configured parameters in
  *         LPBAM_LPTIM_PWMFullAdvConf_t.
  * @param  pInstance         : [IN]  Pointer to a LPTIM_TypeDef structure that selects LPTIM instance.
  * @param  Channel           : [IN]  Specifies the LPTIM channel.
  *                                   This parameter can be a value of @ref LPBAM_LPTIM_Channel.
  * @param  pDMAListInfo      : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and
  *                                   linked-list queue type information.
  * @param  pPWMFull          : [IN]  Pointer to a LPBAM_LPTIM_FullAdvConf_t structure that contains update PWM
  *                                   information.
  * @param  pDescriptor       : [IN]  Pointer to a LPBAM_LPTIM_PWMFullDesc_t structure  that contains update PWM
  *                                   descriptor information.
  * @param  pQueue            : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                                   information.
  * @retval LPBAM Status      : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_LPTIM_PWM_SetFullQ(LPTIM_TypeDef                *const pInstance,
                                            uint32_t                     Channel,
                                            LPBAM_DMAListInfo_t          const *const pDMAListInfo,
                                            LPBAM_LPTIM_PWMFullAdvConf_t const *const pPWMFull,
                                            LPBAM_LPTIM_PWMFullDesc_t    *const pDescriptor,
                                            DMA_QListTypeDef             *const pQueue)
{
  LPBAM_LPTIM_ConfNode_t config_node;
  DMA_NodeConfTypeDef    dma_node_conf;

  uint32_t reg_idx  = 0U;
  uint32_t node_idx = 0U;

