STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_lptim.c
  /* Set LPTIM instance and channel */
  config_node.pInstance                  = pInstance;
  config_node.Config.Channel             = Channel;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;

  /* Set LPTIM configuration */
  config_node.Config.Mode                = LPBAM_LPTIM_PWM_MODE;
  config_node.Config.Size                = 1U;

  if (pPWMFull->UpdatePeriod == ENABLE)
  {
    /*
     *               ######## LPTIM period node ########
     */

    /* Set period value */
    pDescriptor->pReg[reg_idx]           = pPWMFull->PeriodValue;

    /* Set node descriptor */
    config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_LPTIM_UPDATE_PERIOD_ID;
    config_node.NodeDesc.pSrcVarReg      = (uint32_t *)&pDescriptor->pReg[reg_idx];
    config_node.NodeDesc.pBuff           = NULL;

    /* Fill node configuration */
    if (LPBAM_LPTIM_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
    {
      return LPBAM_ERROR;
    }

    /* Build clear flags nodes */
    if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Insert Node to LPTIM queue */
    if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Update register and node indexes */
    node_idx++;
    reg_idx++;
  }


  if (pPWMFull->UpdatePulse == ENABLE)
  {
    /*
     *               ######## LPTIM pulse node ########
     */

    /* Set pulse value */
    pDescriptor->pReg[reg_idx]            = pPWMFull->PulseValue;

    /* Set node descriptor */
    config_node.NodeDesc.NodeInfo.NodeID  = (uint32_t)LPBAM_LPTIM_UPDATE_PULSE_ID;
    config_node.NodeDesc.pSrcVarReg       = (uint32_t *)&pDescriptor->pReg[reg_idx];
    config_node.NodeDesc.pBuff            = NULL;

    /* Fill node configuration */
    if (LPBAM_LPTIM_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
    {
      return LPBAM_ERROR;
    }

    if (pPWMFull->UpdatePeriod == ENABLE)
    {
      dma_node_conf.Init.Request   = DMA_REQUEST_SW;
      dma_node_conf.Init.Direction = DMA_MEMORY_TO_MEMORY;
    }

    /* Build clear flags nodes */
    if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Insert Node to LPTIM queue */
    if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Update register and node indexes */
    node_idx++;
    reg_idx++;
  }


  if (pPWMFull->UpdateRepetition == ENABLE)
  {
    /*
     *               ######## LPTIM repetition node ########
     */


    /* Set repetition value */
    pDescriptor->pReg[reg_idx]            = pPWMFull->RepetitionValue;

    /* Set node descriptor */
    config_node.NodeDesc.NodeInfo.NodeID  = (uint32_t)LPBAM_LPTIM_UPDATE_REPETITION_ID;
    config_node.NodeDesc.pSrcVarReg       = (uint32_t *)&pDescriptor->pReg[reg_idx];
    config_node.NodeDesc.pBuff            = NULL;

    /* Fill node configuration */
    if (LPBAM_LPTIM_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
    {
      return LPBAM_ERROR;
    }

    /* Update DMA request and direction */
    dma_node_conf.Init.Request   = DMA_REQUEST_SW;
    dma_node_conf.Init.Direction = DMA_MEMORY_TO_MEMORY;

    /* Build clear flags nodes */
    if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Insert Node to LPTIM queue */
    if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Update register and node indexes */
    node_idx++;
    reg_idx++;
  }


  if (pPWMFull->UpdatePeriod == DISABLE)
  {
    /*
     *               ######## LPTIM clear flag node ########
     */

    /* Set node descriptor */
    config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_LPTIM_CLEARFLAG_ID;
    config_node.NodeDesc.pSrcVarReg      = (uint32_t *)&pDescriptor->pReg[reg_idx];

    /* Fill node configuration */
    if (LPBAM_LPTIM_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
    {
      return LPBAM_ERROR;
    }

    /* Update DMA request and direction */
    dma_node_conf.Init.Request   = DMA_REQUEST_SW;
    dma_node_conf.Init.Direction = DMA_MEMORY_TO_MEMORY;

    /* Build clear flags nodes */
    if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Insert Node to LPTIM queue */
    if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }
  }

  return LPBAM_OK;
}

/**
  * @brief  Build the LPTIM input capture full DMA linked-list queue according to configured parameters in
  *         LPBAM_LPTIM_ICFullAdvConf_t.
  * @param  pInstance          : [IN]  Pointer to a LPTIM_TypeDef structure that selects LPTIM instance.
  * @param  Channel            : [IN]  Specifies the LPTIM channel.
  *                                    This parameter can be a value of @ref LPBAM_LPTIM_Channel.
  * @param  pDMAListInfo       : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and
  *                                    linked-list queue type information.
  * @param  pICFull            : [IN]  Pointer to a LPBAM_LPTIM_ICFullAdvConf_t structure that contains input capture
  *                                    information.
  * @param  pDescriptor        : [IN]  Pointer to a LPBAM_LPTIM_ICFullDesc_t structure  that contains input capture
  *                                    descriptor information.
  * @param  pQueue             : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                                    information.
  * @retval LPBAM Status       : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_LPTIM_IC_SetFullQ(LPTIM_TypeDef               *const pInstance,
                                           uint32_t                    Channel,
                                           LPBAM_DMAListInfo_t         const *const pDMAListInfo,
                                           LPBAM_LPTIM_ICFullAdvConf_t const *const pICFull,
                                           LPBAM_LPTIM_ICFullDesc_t    *const pDescriptor,
                                           DMA_QListTypeDef            *const pQueue)
{
  LPBAM_LPTIM_ConfNode_t config_node;
  DMA_NodeConfTypeDef    dma_node_conf;

  /* Get repetition buffer address */
  uint32_t buffer_address = (uint32_t)&pICFull->pData[0U];

