STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_lptim.c
  /*
   *               ######## LPTIM input capture node ########
   */

  /* Set LPTIM instance and channel */
  config_node.pInstance                  = pInstance;
  config_node.Config.Channel             = Channel;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_LPTIM_INPUT_CAPTURE_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pBuff             = (uint32_t *)buffer_address;

  /* Set LPTIM configuration */
  config_node.Config.Mode                = (uint32_t)LPBAM_LPTIM_IC_MODE;
  config_node.Config.CaptureCount        = pICFull->Size;

  /* Fill node configuration */
  if (LPBAM_LPTIM_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build clear flags nodes */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[0U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to LPTIM queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[0U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Build the LPTIM compare match full DMA linked-list queue according to configured parameters in
  *         LPBAM_LPTIM_CMFullAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a LPTIM_TypeDef structure that selects LPTIM instance.
  * @param  Channel      : [IN]  Specifies the LPTIM channel.
  *                              This parameter can be a value of @ref LPBAM_LPTIM_Channel.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pCMFull      : [IN]  Pointer to a LPBAM_LPTIM_CMFullAdvConf_t structure that contains compare match
  *                              information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_LPTIM_CMFullDesc_t structure that contains compare match descriptor
  *                              information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_LPTIM_CM_SetFullQ(LPTIM_TypeDef              *const pInstance,
                                           uint32_t                    Channel,
                                           LPBAM_DMAListInfo_t         const *const pDMAListInfo,
                                           LPBAM_LPTIM_CMFullAdvConf_t const *const pCMFull,
                                           LPBAM_LPTIM_CMFullDesc_t    *const pDescriptor,
                                           DMA_QListTypeDef            *const pQueue)
{
  LPBAM_LPTIM_ConfNode_t config_node;
  DMA_NodeConfTypeDef    dma_node_conf;

  uint32_t node_idx = 0U;
  uint32_t reg_idx  = 0U;

  /* Set LPTIM instance and channel */
  config_node.pInstance                   = pInstance;
  config_node.Config.Channel              = Channel;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeType  = pDMAListInfo->QueueType;

  /*
   *               ######## LPTIM period node ########
   */

  /* Set period value */
  pDescriptor->pReg[reg_idx]           = pCMFull->Period;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_LPTIM_UPDATE_PERIOD_ID;
  config_node.NodeDesc.pSrcVarReg      = (uint32_t *)&pDescriptor->pReg[reg_idx];
  config_node.NodeDesc.pBuff           = NULL;

  /* Set LPTIM configuration */
  config_node.Config.Mode              = LPBAM_LPTIM_CM_MODE;
  config_node.Config.Size              = 1U;

  /* Fill node configuration */
  if (LPBAM_LPTIM_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build clear flags nodes */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to LPTIM queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update register and node indexes */
  node_idx++;
  reg_idx++;


  /*
   *               ######## LPTIM repetition node ########
   */

  /* Set repetition value */
  pDescriptor->pReg[reg_idx]           = pCMFull->Repetition;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_LPTIM_UPDATE_REPETITION_ID;
  config_node.NodeDesc.pSrcVarReg      = (uint32_t *)&pDescriptor->pReg[reg_idx];

  /* Fill node configuration */
  if (LPBAM_LPTIM_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build clear flags nodes */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to LPTIM queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Build the LPTIM start full DMA linked-list queue according to configured parameters in
  *         LPBAM_LPTIM_StartFullAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a LPTIM_TypeDef structure that selects LPTIM instance.
  * @param  Channel      : [IN]  Specifies the LPTIM channel.
  *                              This parameter can be a value of @ref LPBAM_LPTIM_Channel.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pStartFull   : [IN]  Pointer to a LPBAM_LPTIM_StartFullAdvConf_t structure that contains start full
  *                              information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_LPTIM_StartFullDesc_t structure  that contains start full descriptor
  *                              information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_LPTIM_Start_SetFullQ(LPTIM_TypeDef                  *const pInstance,
                                              uint32_t                       Channel,
                                              LPBAM_DMAListInfo_t            const *const pDMAListInfo,
                                              LPBAM_LPTIM_StartFullAdvConf_t const *const pStartFull,
                                              LPBAM_LPTIM_StartFullDesc_t    *const pDescriptor,
                                              DMA_QListTypeDef               *const pQueue)
{
  LPBAM_LPTIM_ConfNode_t config_node;
  DMA_NodeConfTypeDef    dma_node_conf;

  uint32_t reg_idx  = 0U;
  uint32_t node_idx = 0U;

