STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_lptim.c
  /*
   *               ######## LPTIM enable node ########
   */

  /* Set LPTIM instance and channel */
  config_node.pInstance                  = pInstance;
  config_node.Config.Channel             = Channel;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_LPTIM_CONFIG_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[reg_idx];

  /* Set LPTIM configuration */
  config_node.Config.State               = ENABLE;
  config_node.Config.UpdateStartMode     = DISABLE;

  /* Fill node configuration */
  if (LPBAM_LPTIM_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build stop node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to LPTIM queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update register and node indexes */
  node_idx++;
  reg_idx++;


  /*
   *               ######## LPTIM wake up it node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_LPTIM_WAKEUP_IT_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[reg_idx];

  /* Set LPTIM configuration */
  config_node.Config.WakeupIT          = pStartFull->WakeupIT;

  /* Fill node configuration */
  if (LPBAM_LPTIM_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build stop node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to LPTIM queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update register and node indexes */
  node_idx++;
  reg_idx++;


  /*
   *               ######## LPTIM configuration node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_LPTIM_CONFIG_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[reg_idx];

  /* Set LPTIM configuration */
  config_node.Config.UpdateStartMode   = ENABLE;
  config_node.Config.StartMode         = pStartFull->StartMode;

  /* Fill node configuration */
  if (LPBAM_LPTIM_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build stop node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to LPTIM queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Build the LPTIM stop full DMA linked-list queue.
  * @param  pInstance    : [IN]  Pointer to a LPTIM_TypeDef structure that selects LPTIM instance.
  * @param  pStopFull    : [IN]  Pointer to a LPBAM_LPTIM_StopFullAdvConf_t structure that contains stop full
  *                              information.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_LPTIM_StopFullDesc_t structure  that contains start full descriptor
  *                              information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_LPTIM_Stop_SetFullQ(LPTIM_TypeDef                 *const pInstance,
                                             LPBAM_DMAListInfo_t           const *const pDMAListInfo,
                                             LPBAM_LPTIM_StopFullAdvConf_t const *const pStopFull,
                                             LPBAM_LPTIM_StopFullDesc_t    *const pDescriptor,
                                             DMA_QListTypeDef              *const pQueue)
{
  LPBAM_LPTIM_ConfNode_t config_node;
  DMA_NodeConfTypeDef    dma_node_conf;

  /*
   *               ######## LPTIM stop node ########
   */

  /* Set LPTIM instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_LPTIM_CONFIG_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[0U];

  /* Set LPTIM configuration */
  config_node.Config.State               = DISABLE;
  config_node.Config.Mode                = pStopFull->Mode;

  /* Fill node configuration */
  if (LPBAM_LPTIM_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build stop node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[0U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert Node to LPTIM queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[0U]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Enable the LPTIM DMA requests.
  * @param  pInstance    : [IN]  Pointer to a LPTIM_TypeDef structure that selects LPTIM instance.
  * @param  Channel      : [IN]  Specifies the LPTIM channel.
  *                              This parameter can be a value or a combination of @ref LPBAM_LPTIM_Channel.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_LPTIM_EnableDMARequests(LPTIM_TypeDef *const pInstance,
                                                 uint32_t      Channel)
{
  /* Enable update event request */
  pInstance->DIER |= LPBAM_LPTIM_UEDE;

  /* Check channel index */
  if ((Channel & LPBAM_LPTIM_CHANNEL_1) == LPBAM_LPTIM_CHANNEL_1)
  {
    /* Enable Channel */
    pInstance->CCMR1 |= LPBAM_LPTIM_CC1E;

    /* Enable input capture DMA request */
    pInstance->DIER |= LPBAM_LPTIM_CC1DE;
  }

  if ((Channel & LPBAM_LPTIM_CHANNEL_2) == LPBAM_LPTIM_CHANNEL_2)
  {
    /* Enable Channel */
    pInstance->CCMR1 |= LPBAM_LPTIM_CC2E;

    /* Enable input capture DMA request */
    pInstance->DIER |= LPBAM_LPTIM_CC2DE;
  }

  return LPBAM_OK;
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* LPBAM_LPTIM_MODULE_ENABLED */
